{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          2
        ],
        "tokens": [
          "</s>"
        ]
      },
      "<s>": {
        "id": "<s>",
        "ids": [
          0
        ],
        "tokens": [
          "<s>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "!": 4,
      "\"": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\!": 60,
      "\\#": 61,
      "\\%": 62,
      "\\&": 63,
      "\\AA": 64,
      "\\AE": 65,
      "\\Bbbk": 66,
      "\\Beta": 67,
      "\\Big": 68,
      "\\Bigg": 69,
      "\\Biggl": 70,
      "\\Biggm": 71,
      "\\Biggr": 72,
      "\\Bigl": 73,
      "\\Bigm": 74,
      "\\Bigr": 75,
      "\\Bumpeq": 76,
      "\\Cap": 77,
      "\\Chi": 78,
      "\\Cup": 79,
      "\\Darr": 80,
      "\\Delta": 81,
      "\\Finv": 82,
      "\\Game": 83,
      "\\Gamma": 84,
      "\\H": 85,
      "\\Harr": 86,
      "\\Huge": 87,
      "\\Im": 88,
      "\\Join": 89,
      "\\LARGE": 90,
      "\\Lambda": 91,
      "\\Large": 92,
      "\\Larr": 93,
      "\\Lleftarrow": 94,
      "\\Longleftarrow": 95,
      "\\Longleftrightarrow": 96,
      "\\Longrightarrow": 97,
      "\\Lsh": 98,
      "\\Nu": 99,
      "\\O": 100,
      "\\Omega": 101,
      "\\P": 102,
      "\\Phi": 103,
      "\\Pi": 104,
      "\\Pr": 105,
      "\\Psi": 106,
      "\\Rarr": 107,
      "\\Re": 108,
      "\\Rrightarrow": 109,
      "\\Rsh": 110,
      "\\S": 111,
      "\\Sigma": 112,
      "\\Subset": 113,
      "\\Supset": 114,
      "\\Theta": 115,
      "\\Uparrow": 116,
      "\\Updownarrow": 117,
      "\\Upsilon": 118,
      "\\Vdash": 119,
      "\\Vvdash": 120,
      "\\Xi": 121,
      "\\Zeta": 122,
      "\\\\": 123,
      "\\_": 124,
      "\\aa": 125,
      "\\acute": 126,
      "\\ae": 127,
      "\\aleph": 128,
      "\\alpha": 129,
      "\\amalg": 130,
      "\\angle": 131,
      "\\approx": 132,
      "\\approxeq": 133,
      "\\arccos": 134,
      "\\arcsin": 135,
      "\\arctan": 136,
      "\\arg": 137,
      "\\ast": 138,
      "\\asymp": 139,
      "\\atop": 140,
      "\\backepsilon": 141,
      "\\backprime": 142,
      "\\backsim": 143,
      "\\backsimeq": 144,
      "\\backslash": 145,
      "\\bar": 146,
      "\\barwedge": 147,
      "\\because": 148,
      "\\begin{array}": 149,
      "\\beta": 150,
      "\\beth": 151,
      "\\between": 152,
      "\\bf": 153,
      "\\big": 154,
      "\\bigcap": 155,
      "\\bigcirc": 156,
      "\\bigcup": 157,
      "\\bigg": 158,
      "\\biggl": 159,
      "\\biggm": 160,
      "\\biggr": 161,
      "\\bigl": 162,
      "\\bigm": 163,
      "\\bigodot": 164,
      "\\bigoplus": 165,
      "\\bigotimes": 166,
      "\\bigr": 167,
      "\\bigsqcup": 168,
      "\\bigstar": 169,
      "\\bigtriangledown": 170,
      "\\bigtriangleup": 171,
      "\\biguplus": 172,
      "\\bigvee": 173,
      "\\bigwedge": 174,
      "\\binom": 175,
      "\\blacktriangle": 176,
      "\\blacktriangledown": 177,
      "\\blacktriangleleft": 178,
      "\\blacktriangleright": 179,
      "\\bmod": 180,
      "\\boldsymbol": 181,
      "\\bot": 182,
      "\\bowtie": 183,
      "\\boxdot": 184,
      "\\boxed": 185,
      "\\boxminus": 186,
      "\\boxplus": 187,
      "\\boxtimes": 188,
      "\\brace": 189,
      "\\brack": 190,
      "\\breve": 191,
      "\\bullet": 192,
      "\\bumpeq": 193,
      "\\cal": 194,
      "\\cap": 195,
      "\\cdot": 196,
      "\\cdotp": 197,
      "\\cdots": 198,
      "\\cfrac": 199,
      "\\check": 200,
      "\\checkmark": 201,
      "\\chi": 202,
      "\\circ": 203,
      "\\circeq": 204,
      "\\circledast": 205,
      "\\circledcirc": 206,
      "\\circleddash": 207,
      "\\clubsuit": 208,
      "\\colon": 209,
      "\\coloneq": 210,
      "\\complement": 211,
      "\\cong": 212,
      "\\coprod": 213,
      "\\copyright": 214,
      "\\cos": 215,
      "\\cosh": 216,
      "\\cot": 217,
      "\\coth": 218,
      "\\csc": 219,
      "\\cup": 220,
      "\\curlyeqprec": 221,
      "\\curlyeqsucc": 222,
      "\\curlyvee": 223,
      "\\curlywedge": 224,
      "\\curvearrowleft": 225,
      "\\curvearrowright": 226,
      "\\dag": 227,
      "\\daleth": 228,
      "\\darr": 229,
      "\\dashv": 230,
      "\\ddag": 231,
      "\\ddddot": 232,
      "\\dddot": 233,
      "\\ddot": 234,
      "\\ddots": 235,
      "\\deg": 236,
      "\\degree": 237,
      "\\delta": 238,
      "\\det": 239,
      "\\diagdown": 240,
      "\\diagup": 241,
      "\\diamond": 242,
      "\\diamondsuit": 243,
      "\\digamma": 244,
      "\\dim": 245,
      "\\div": 246,
      "\\divideontimes": 247,
      "\\dot": 248,
      "\\doteq": 249,
      "\\dotplus": 250,
      "\\dots": 251,
      "\\dotsb": 252,
      "\\dotsc": 253,
      "\\dotsi": 254,
      "\\dotsm": 255,
      "\\dotso": 256,
      "\\doublebarwedge": 257,
      "\\downdownarrows": 258,
      "\\downharpoonleft": 259,
      "\\downharpoonright": 260,
      "\\ell": 261,
      "\\emph": 262,
      "\\empty": 263,
      "\\end{array}": 264,
      "\\epsilon": 265,
      "\\eqcirc": 266,
      "\\eqsim": 267,
      "\\eqslantgtr": 268,
      "\\eqslantless": 269,
      "\\equiv": 270,
      "\\eta": 271,
      "\\eth": 272,
      "\\exists": 273,
      "\\exp": 274,
      "\\fallingdotseq": 275,
      "\\flat": 276,
      "\\footnotesize": 277,
      "\\forall": 278,
      "\\frac": 279,
      "\\frown": 280,
      "\\gamma": 281,
      "\\gcd": 282,
      "\\ge": 283,
      "\\geq": 284,
      "\\geqq": 285,
      "\\geqslant": 286,
      "\\gg": 287,
      "\\ggg": 288,
      "\\gimel": 289,
      "\\gnapprox": 290,
      "\\gneq": 291,
      "\\gneqq": 292,
      "\\gnsim": 293,
      "\\grave": 294,
      "\\gtrapprox": 295,
      "\\gtrdot": 296,
      "\\gtreqless": 297,
      "\\gtreqqless": 298,
      "\\gtrless": 299,
      "\\gtrsim": 300,
      "\\harr": 301,
      "\\hat": 302,
      "\\hbar": 303,
      "\\heartsuit": 304,
      "\\hom": 305,
      "\\hookleftarrow": 306,
      "\\hookrightarrow": 307,
      "\\hslash": 308,
      "\\huge": 309,
      "\\i": 310,
      "\\iff": 311,
      "\\iiint": 312,
      "\\iint": 313,
      "\\imath": 314,
      "\\implies": 315,
      "\\in": 316,
      "\\infin": 317,
      "\\int": 318,
      "\\intercal": 319,
      "\\intop": 320,
      "\\iota": 321,
      "\\it": 322,
      "\\j": 323,
      "\\jmath": 324,
      "\\kappa": 325,
      "\\ker": 326,
      "\\lambda": 327,
      "\\land": 328,
      "\\langle": 329,
      "\\large": 330,
      "\\larr": 331,
      "\\lceil": 332,
      "\\ldotp": 333,
      "\\le": 334,
      "\\left": 335,
      "\\leftarrowtail": 336,
      "\\leftharpoondown": 337,
      "\\leftharpoonup": 338,
      "\\leftleftarrows": 339,
      "\\leftrightarrows": 340,
      "\\leftrightharpoons": 341,
      "\\leftrightsquigarrow": 342,
      "\\leftthreetimes": 343,
      "\\leq": 344,
      "\\leqq": 345,
      "\\leqslant": 346,
      "\\lessapprox": 347,
      "\\lessdot": 348,
      "\\lesseqgtr": 349,
      "\\lesseqqgtr": 350,
      "\\lessgtr": 351,
      "\\lesssim": 352,
      "\\lfloor": 353,
      "\\lg": 354,
      "\\lgroup": 355,
      "\\lim": 356,
      "\\ll": 357,
      "\\llap": 358,
      "\\llcorner": 359,
      "\\lll": 360,
      "\\ln": 361,
      "\\lnapprox": 362,
      "\\lneq": 363,
      "\\lneqq": 364,
      "\\lnot": 365,
      "\\lnsim": 366,
      "\\log": 367,
      "\\longleftarrow": 368,
      "\\longleftrightarrow": 369,
      "\\longmapsto": 370,
      "\\longrightarrow": 371,
      "\\looparrowleft": 372,
      "\\looparrowright": 373,
      "\\lor": 374,
      "\\lrcorner": 375,
      "\\ltimes": 376,
      "\\mapsto": 377,
      "\\mathbb": 378,
      "\\mathbf": 379,
      "\\mathcal": 380,
      "\\mathellipsis": 381,
      "\\mathfrak": 382,
      "\\mathit": 383,
      "\\mathnormal": 384,
      "\\mathring": 385,
      "\\mathrm": 386,
      "\\mathscr": 387,
      "\\mathsf": 388,
      "\\mathsfit": 389,
      "\\mathtt": 390,
      "\\max": 391,
      "\\measuredangle": 392,
      "\\mho": 393,
      "\\mid": 394,
      "\\middle": 395,
      "\\min": 396,
      "\\mod": 397,
      "\\models": 398,
      "\\mp": 399,
      "\\mu": 400,
      "\\multimap": 401,
      "\\nLeftarrow": 402,
      "\\nLeftrightarrow": 403,
      "\\nRightarrow": 404,
      "\\nVDash": 405,
      "\\nVdash": 406,
      "\\nabla": 407,
      "\\natural": 408,
      "\\ncong": 409,
      "\\ne": 410,
      "\\nearrow": 411,
      "\\neg": 412,
      "\\neq": 413,
      "\\nexists": 414,
      "\\ngeq": 415,
      "\\ngtr": 416,
      "\\ni": 417,
      "\\nleftarrow": 418,
      "\\nleftrightarrow": 419,
      "\\nleq": 420,
      "\\nless": 421,
      "\\nmid": 422,
      "\\normalsize": 423,
      "\\not": 424,
      "\\notin": 425,
      "\\nparallel": 426,
      "\\nprec": 427,
      "\\nrightarrow": 428,
      "\\nsim": 429,
      "\\nsubseteq": 430,
      "\\nsucc": 431,
      "\\nsupseteq": 432,
      "\\ntrianglelefteq": 433,
      "\\ntrianglerighteq": 434,
      "\\nu": 435,
      "\\nvDash": 436,
      "\\nvdash": 437,
      "\\nwarrow": 438,
      "\\o": 439,
      "\\odot": 440,
      "\\oiiint": 441,
      "\\oiint": 442,
      "\\oint": 443,
      "\\omega": 444,
      "\\ominus": 445,
      "\\operatorname": 446,
      "\\operatorname*": 447,
      "\\oplus": 448,
      "\\oslash": 449,
      "\\otimes": 450,
      "\\overbrace": 451,
      "\\overleftarrow": 452,
      "\\overleftrightarrow": 453,
      "\\overline": 454,
      "\\overrightarrow": 455,
      "\\overrightharpoon": 456,
      "\\overset": 457,
      "\\owns": 458,
      "\\parallel": 459,
      "\\partial": 460,
      "\\perp": 461,
      "\\phi": 462,
      "\\pi": 463,
      "\\pitchfork": 464,
      "\\pm": 465,
      "\\pmb": 466,
      "\\pmod": 467,
      "\\pounds": 468,
      "\\prec": 469,
      "\\precapprox": 470,
      "\\preccurlyeq": 471,
      "\\preceq": 472,
      "\\precnapprox": 473,
      "\\precneqq": 474,
      "\\precnsim": 475,
      "\\precsim": 476,
      "\\prime": 477,
      "\\prod": 478,
      "\\propto": 479,
      "\\psi": 480,
      "\\qquad": 481,
      "\\quad": 482,
      "\\rangle": 483,
      "\\rarr": 484,
      "\\rceil": 485,
      "\\rfloor": 486,
      "\\rgroup": 487,
      "\\rho": 488,
      "\\right": 489,
      "\\rightarrowtail": 490,
      "\\rightharpoondown": 491,
      "\\rightharpoonup": 492,
      "\\rightleftarrows": 493,
      "\\rightleftharpoons": 494,
      "\\rightrightarrows": 495,
      "\\rightsquigarrow": 496,
      "\\rightthreetimes": 497,
      "\\risingdotseq": 498,
      "\\rlap": 499,
      "\\rq": 500,
      "\\rtimes": 501,
      "\\scriptsize": 502,
      "\\searrow": 503,
      "\\sec": 504,
      "\\setminus": 505,
      "\\sf": 506,
      "\\sharp": 507,
      "\\sigma": 508,
      "\\sim": 509,
      "\\simeq": 510,
      "\\sin": 511,
      "\\sinh": 512,
      "\\small": 513,
      "\\smallint": 514,
      "\\smash": 515,
      "\\smile": 516,
      "\\spadesuit": 517,
      "\\sphericalangle": 518,
      "\\sqcap": 519,
      "\\sqcup": 520,
      "\\sqrt": 521,
      "\\sqsubset": 522,
      "\\sqsubseteq": 523,
      "\\sqsupset": 524,
      "\\sqsupseteq": 525,
      "\\square": 526,
      "\\ss": 527,
      "\\stackrel": 528,
      "\\star": 529,
      "\\subset": 530,
      "\\subseteq": 531,
      "\\subseteqq": 532,
      "\\subsetneq": 533,
      "\\subsetneqq": 534,
      "\\substack": 535,
      "\\succ": 536,
      "\\succapprox": 537,
      "\\succcurlyeq": 538,
      "\\succeq": 539,
      "\\succnapprox": 540,
      "\\succneqq": 541,
      "\\succnsim": 542,
      "\\succsim": 543,
      "\\sum": 544,
      "\\sup": 545,
      "\\supset": 546,
      "\\supseteq": 547,
      "\\supseteqq": 548,
      "\\supsetneq": 549,
      "\\supsetneqq": 550,
      "\\surd": 551,
      "\\swarrow": 552,
      "\\tan": 553,
      "\\tau": 554,
      "\\textbackslash": 555,
      "\\textbar": 556,
      "\\textbf": 557,
      "\\textcircled": 558,
      "\\textdegree": 559,
      "\\textemdash": 560,
      "\\textgreater": 561,
      "\\textit": 562,
      "\\textless": 563,
      "\\textmd": 564,
      "\\textnormal": 565,
      "\\textquoteright": 566,
      "\\textregistered": 567,
      "\\textrm": 568,
      "\\textsf": 569,
      "\\texttt": 570,
      "\\textunderscore": 571,
      "\\textup": 572,
      "\\th": 573,
      "\\therefore": 574,
      "\\theta": 575,
      "\\tilde": 576,
      "\\times": 577,
      "\\tiny": 578,
      "\\top": 579,
      "\\triangle": 580,
      "\\triangledown": 581,
      "\\triangleleft": 582,
      "\\trianglelefteq": 583,
      "\\triangleq": 584,
      "\\triangleright": 585,
      "\\trianglerighteq": 586,
      "\\tt": 587,
      "\\twoheadleftarrow": 588,
      "\\twoheadrightarrow": 589,
      "\\ulcorner": 590,
      "\\underbar": 591,
      "\\underbrace": 592,
      "\\underleftarrow": 593,
      "\\underline": 594,
      "\\underrightarrow": 595,
      "\\underset": 596,
      "\\uparrow": 597,
      "\\updownarrow": 598,
      "\\upharpoonleft": 599,
      "\\upharpoonright": 600,
      "\\uplus": 601,
      "\\upsilon": 602,
      "\\upuparrows": 603,
      "\\urcorner": 604,
      "\\vDash": 605,
      "\\varDelta": 606,
      "\\varGamma": 607,
      "\\varLambda": 608,
      "\\varOmega": 609,
      "\\varPhi": 610,
      "\\varPi": 611,
      "\\varPsi": 612,
      "\\varSigma": 613,
      "\\varTheta": 614,
      "\\varUpsilon": 615,
      "\\varXi": 616,
      "\\varepsilon": 617,
      "\\varinjlim": 618,
      "\\varkappa": 619,
      "\\varliminf": 620,
      "\\varlimsup": 621,
      "\\varnothing": 622,
      "\\varphi": 623,
      "\\varpi": 624,
      "\\varprojlim": 625,
      "\\varrho": 626,
      "\\varsigma": 627,
      "\\vartheta": 628,
      "\\vartriangle": 629,
      "\\vartriangleleft": 630,
      "\\vartriangleright": 631,
      "\\vdash": 632,
      "\\vdots": 633,
      "\\vec": 634,
      "\\vee": 635,
      "\\veebar": 636,
      "\\wedge": 637,
      "\\widecheck": 638,
      "\\widehat": 639,
      "\\widetilde": 640,
      "\\wp": 641,
      "\\wr": 642,
      "\\xi": 643,
      "\\xleftarrow": 644,
      "\\xlongequal": 645,
      "\\xrightarrow": 646,
      "\\zeta": 647,
      "\\{": 648,
      "\\|": 649,
      "\\}": 650,
      "]": 651,
      "^": 652,
      "_": 653,
      "`": 654,
      "a": 655,
      "b": 656,
      "c": 657,
      "d": 658,
      "e": 659,
      "f": 660,
      "g": 661,
      "h": 662,
      "i": 663,
      "j": 664,
      "k": 665,
      "l": 666,
      "m": 667,
      "n": 668,
      "o": 669,
      "p": 670,
      "q": 671,
      "r": 672,
      "s": 673,
      "t": 674,
      "u": 675,
      "v": 676,
      "w": 677,
      "x": 678,
      "y": 679,
      "z": 680,
      "{": 681,
      "|": 682,
      "}": 683,
      "~": 684,
      "、": 685,
      "。": 686
    },
    "unk_token": "<unk>"
  }
}